export const AgreementTerms = () => {
  return (
    <div>
      <h3 className="text-center">使用条款、政策和免责声明</h3>
      <article>
        您使用我们位于www.mgjkn.com的网站（以及与之链接的所有相关网站）或服务（“TodayStockKing”）的肯定行为表示您同意以下使用条款和条件（“使用条款”）。如果您不同意，请不要使用TodayStockKing。TodayStockKing是广西新缠股份有限公司（“我们”、“我们”或“我们的”）的财产。
      </article>
      <h4>1. 使用条款的变更</h4>
      <article>
        我们可能会随时更改这些使用条款。如果您在我们发布这些使用条款的更改后继续使用TodayStockKing，则表示您接受新条款。您将始终可以访问我们的使用条款，并可以随时查看。通过重新加载此页面，您将获得TodayStockKing用户可用的最新版本。
      </article>
      <h4>2. TodayStockKing的更改</h4>
      <article>我们可能会随时停止或更改TodayStockKing上的任何服务或功能，恕不另行通知。在这种情况下，我们不保证我们的服务和应用程序编程接口（API）的向后兼容性。</article>
      <h4>3. 信息所有权；使用TodayStockKing的许可证；数据重新分发；非显示使用</h4>
      <article>
        除非另有说明，否则TodayStockKing的所有权利、所有权和权益，以及通过TodayStockKing或我们的服务提供的所有信息，包括但不限于其中的所有版权和商标，都是TodayStockKing、我们的附属公司或我们的数据提供商的专有财产，如下文第6节（内容免责声明）所述。

        TodayStockKing平台上提供的内容和市场数据，包括但不限于图表、警报、webhooks和任何其他形式的信息，均已获得独家显示使用许可。此许可严格限于个人或内部业务目的，并明确禁止任何形式的非显示使用。此类禁止使用包括但不限于任何形式的自动交易、自动订单生成、价格参考、订单验证、算法决策、算法交易、智能订单路由、在运营控制或风险管理程序中使用数据，或任何不涉及直接、人性化显示此类数据的机器驱动流程。此类禁止情况还包括基于 TodayStockKing 内容创建产品或服务、对 TodayStockKing 内容的任何处理，或任何其他破坏数据提供商所设限制的使用情况。
        尽管有上述规定，我们明确禁止用户直接非显示使用，也禁止开发、提供或使用任何旨在促进或实现对 TodayStockKing 内容和市场数据进行此类非显示使用的第三方产品、工具或服务。为避免疑问，在此明确禁止任何第三方创建、提供或运营以下产品或服务：<br/>
        &emsp;1. 利用、重新利用或依赖 TodayStockKing 的市场数据，包括   但不限于图表、警报、webhook 和 TodayStockKing 提供的任何形式的信息，用于任何形式的自动交易、算法决策或任何其他非显示目的。<br/>
        &emsp;2. 促进、支持或鼓励 TodayStockKing 用户或任何其他方从事违反本政策的活动，包括但不限于自动订单生成、价格参考、订单验证、智能订单路由或在运营控制、风险管理程序或任何机器驱动流程中使用 TodayStockKing 数据，但不包括直接、人类可读的显示。<br/>
        &emsp;3. 声称与TodayStockKing的功能（如webhooks）兼容，或宣传将其用于TodayStockKing条款明确禁止的目的，从而间接导致违反TodayStockKing使用限制。<br/>
        本政策适用于所有实体，无论它们是 TodayStockKing 服务的直接用户还是第三方服务提供商。TodayStockKing 提供的功能（例如 webhook）仅用于最初定义的显示和个人或内部业务目的范围内的允许用途。任何违反本政策精神或文字的解释、改编或利用这些功能的行为都是严格禁止的。任何第三方提供商试图声称未使用 TodayStockKing 的服务作为促进禁止使用 TodayStockKing 数据的辩护的行为在此被宣布为无效。本政策中所述的内容同样适用于 TodayStockKing 的直接用户以及提供与 TodayStockKing 数据交互或使用 TodayStockKing 数据的服务或产品的任何第三方实体，无论他们是否直接参与 TodayStockKing 平台。
        除非另有明确许可，否则我们与数据提供商的协议严格禁止以任何形式的报酬再授权、分配、转让、出售、借出或分发 TodayStockKing 内容（包括市场数据）。此外，未经 TodayStockKing 和相关数据提供商事先书面同意，您不得以电子或其他方式复制可能提供的任何软件或文档，包括但不限于翻译、反编译、反汇编或创建衍生作品。
        除非附加协议另有明确许可，否则我们不允许将我们的任何服务或 API 用于商业用途。我们不对第三方服务或软件提供任何保证，也不承担任何义务或责任。有关更多信息，请参阅下面的第 21 节（第三方软件）。
        TodayStockKing 保留采取任何和所有必要行动（包括法律措施）的权利，以确保遵守这些条款、保护其知识产权并维护其服务的完整性。这包括对涉嫌违规行为进行审计或调查，以及对任何被发现违反这些条款的各方（无论是用户还是第三方提供商）提起法律诉讼。此类违规行为的后果包括但不限于屏蔽用户或访问者、终止其帐户以及可能的法律处罚。TodayStockKing 可能会终止对其服务的访问、寻求禁令救济并要求赔偿，以维护其合同权利以及其数据提供商和用户社区的利益。这些行动突显了TodayStockKing对执行其政策和保护平台可信环境的承诺。
      </article>
      <h4>4.归属</h4>
      <article>
        TodayStockKing 授予 TodayStockKing.com 和该网站所有其他可用版本的所有用户在分析、新闻稿、书籍、文章、博客文章和其他出版物中使用 TodayStockKing 图表快照的权利。此外，TodayStockKing 授权在教育课程中使用前面提到的所有材料，在视频广播期间显示 TodayStockKing 图表，包括概览、新闻、分析，并以其他方式使用或推广 TodayStockKing 图表或 TodayStockKing 网站上的任何产品，条件是使用此类图表和产品时，TodayStockKing 的归属始终清晰可见。
        归属必须包括对 TodayStockKing 的引用，包括但不限于本文所述的内容。
        在视频或其他促销活动中使用 TodayStockKing 图表，如果看不到 TodayStockKing 的归属，则必须包括其中所用产品的描述。例如：“用于此分析的图表平台由 TodayStockKing 提供”，或简称为“图表由 TodayStockKing 提供”。字体大小不应小于 10 PT = 13PX = 3.4MM。
        您可以使用图表顶部工具栏中的“快照”按钮立即创建当前图表的图片文件。TodayStockKing 将自动拍摄包含所有必需归属的快照，并提供一个链接，您可以在其中查看、下载或共享图表。未经 TodayStockKing 适当归因，不得在 TodayStockKing 网站之外使用任何 TodayStockKing 产品。这扩展到在 TodayStockKing 网站上获得并在外部资源上使用的任何工具（例如小部件），其归因应保持最初的设计和意图。违反此归因规则的用户可能会被永久禁止，并可能采取其他法律行动以确保合规。这包括但不限于停止和终止警告、法院命令、禁令、罚款、损害赔偿等。
      </article>
      <h4>5. 第三方网站和广告商</h4>
      <article>
        TodayStockKing 可能包含第三方网站的链接。其中一些网站可能包含令人反感、非法或不准确的材料。您同意 TodayStockKing 不对您通过 TodayStockKing 上的链接访问的任何网站上发生的任何交易活动或其他活动负责。我们提供这些链接是为了方便您，并不认可这些其他网站提供的内容或服务。您与 TodayStockKing 上的广告商之间的任何交易都是您和广告商之间的交易，您承认并同意我们对您可能对广告商造成的任何损失或索赔不承担责任。
        TodayStockKing 上未经授权的招揽是严格禁止的，并可能导致处罚，包括但不限于对违规账户的临时或永久禁令，以及对金钱和其他损害采取任何适当且可用的法律行动。
      </article>
      <h4>6. 免责声明</h4>
      <article>
        TodayStockKing 网站和服务以及本网站和服务中包含的或以其他方式提供给您的所有信息、内容、材料和产品均由 TodayStockKing 按“原样”和“可用”提供。TodayStockKing 不作任何明示或暗示的陈述或保证，包括但不限于通过我们的服务或 TodayStockKing 提供的任何信息准确、可靠、最新、完整或适合您的需求。 TodayStockKing 不保证、声明或担保您对服务的使用不会中断或出现错误，并且您同意 TodayStockKing 可能会不时无限期地删除服务，或根据本使用条款的条款取消服务。TodayStockKing 不声明或担保服务不会出现损失、损坏、攻击、病毒、干扰、黑客或其他安全入侵，并且 TodayStockKing 不承担与此相关的任何责任。通过使用本服务下载或以其他方式获取的任何材料均由您自行决定并承担风险，您将对因下载或使用任何此类材料而导致的任何损害或损失承担全部责任。
        通过我们的服务或在 TodayStockKing 上提供的各种信息可能由 TodayStockKing 从专业企业或组织特别获取，例如交易所、新闻提供商、市场数据提供商和其他内容提供商（包括纽约证券交易所、纳斯达克和芝加哥商品交易所等知名金融交易所），这些提供商被认为是可靠信息的来源（统称为“数据提供商”）。然而，由于各种因素（包括人为和机械错误固有的可能性），TodayStockKing 无法保证通过我们的服务和网站提供的信息的准确性、完整性、及时性、使用结果和正确排序。同样，我们对脚本、指标、想法和其他第三方内容不作任何保证，也不承担任何义务或责任。您使用任何第三方脚本、指标、想法和其他内容的风险由您自行承担。
      </article>
      <h4>7. 关于投资决策和交易的免责声明</h4>
      <article>购买、出售、持有或交易证券、商品和其他投资的决定涉及风险，最好根据合格金融专业人士的建议做出。任何证券或其他投资交易都涉及重大损失的风险。“日内交易”的做法涉及特别高的风险，可能会导致您损失大量资金。在进行任何交易计划之前，您应该咨询合格的金融专业人士。请根据您的财务状况和承担财务风险的能力仔细考虑此类交易是否适合您。在任何情况下，我们均不对您或任何其他人因您或任何其他人根据您通过 TodayStockKing 或我们的服务收到的任何信息或材料从事的任何交易或投资活动而遭受的任何损失或损害负责。</article>
      <h4>8. 关于假设业绩结果的免责声明</h4>
      <article>
        假设业绩结果具有许多固有的局限性，其中一些在下文中提到。不保证任何账户将或可能实现与所示类似的利润或损失。事实上，假设业绩结果与任何特定交易程序随后实现的实际结果之间经常存在巨大差异。
        假设业绩结果的局限性之一是，它们通常是事后才准备的。此外，假设交易不涉及财务风险，没有任何假设交易记录可以完全说明财务风险对实际交易的影响。例如，承受损失的能力或在交易亏损的情况下坚持特定交易计划的能力是关键点，也可能对交易结果产生不利影响。还有许多其他与市场总体或任何特定交易程序的实施相关的因素，在准备假设业绩结果时无法完全考虑这些因素，所有这些因素都可能对实际交易结果产生不利影响。
      </article>
      <h4>9. 注册用户</h4>
      <article>
        某些服务（例如保存图表、发布图表或对已发布的图表发表评论）仅向 TodayStockKing 网站的注册用户提供，并且需要您使用用户名和密码登录才能使用。如果您注册为 TodayStockKing 任何功能的用户（“订阅者”），在注册过程中，系统可能会提示您单击“立即注册”、“提交”或类似按钮；您单击此类按钮将进一步确认您同意受本使用条款的法律约束。
        考虑到您使用 TodayStockKing 网站，您表明您已达到法定年龄，可以签订具有约束力的合同，并且不是根据美国或其他适用司法管辖区的法律被禁止接受 TodayStockKing 服务的人。您还同意：(a) 根据 TodayStockKing 的注册表单（“注册数据”）的提示提供有关您自己的真实、准确、最新和完整的信息；(b) 维护并及时更新注册数据，以使其保持真实、准确、最新和完整。如果您提供任何不真实、不准确、非最新或不完整的信息，或者 TodayStockKing 有合理理由怀疑此类信息不真实、不准确、非最新或不完整，TodayStockKing 有权暂停或终止您的帐户并拒绝您当前或未来使用 TodayStockKing 服务（或其任何部分）。
        您声明并保证您拥有内容中的所有知识产权，包括所有必要的专利、商标、商业秘密、版权或其他专有权利。如果您使用第三方材料，您声明并保证您有权在内容中分发第三方材料。您同意，您不会提交受版权保护、受商业秘密保护或以其他方式受第三方专有权利（包括专利、隐私和公开权）保护的材料，除非您是此类权利的所有者或已获得其合法所有者的许可提交材料。
        如果我们有理由相信您违反了我们的使用条款，我们可能会在未经通知的情况下删除您的内容。
      </article>
      <h4>10. 访问和安全</h4>
      <article>
        您接受对用于注册以访问和使用我们的服务的任何用户名和电子邮件地址的保密性和使用的责任。您有责任维护您的密码和帐户的保密性，并对使用您的密码或帐户进行的所有活动负全部责任。TodayStockKing 不能也不会对因您未能遵守此安全义务而造成的任何损失或损害负责。您同意 (a) 立即通知 TodayStockKing 任何未经授权使用您的密码或帐户或任何其他违反安全的行为，以及 (b) 确保您在每次会话结束时退出您的帐户。TodayStockKing 不能也不会对因您未能遵守而造成的任何损失或损害负责。
      </article>
      <h4>11. 付款和取消服务</h4>
      <article>
        <br/>&emsp;1. 通过在 www.mgjkn.com或 我们的产品订购任何订阅，您确认您已阅读并接受我们的使用条款，并授权 TodayStockKing 根据您手动选择的计费期自动向您的银行卡、PayPal 帐户或其他支持的付款方式收费。
        <br/>&emsp;2. 该服务按月或按年提前计费。如果未在到期日之前取消试用，则根据用户的选择，它将自动转换为按月或按年付费计划。
        <br/>&emsp;3. 所有计费都是定期的，这意味着您将继续收到账单，直到您取消订阅。您全权负责正确取消您的 TodayStockKing 订阅。要求取消订阅的电子邮件请求或支持票不被视为取消。您可以随时通过访问个人资料设置页面的计费部分取消订阅。
        <br/>&emsp;4. 如果您在当前付费期结束之前取消服务，您的订阅将保持有效，直到下一个到期日。到期日后，如果未收到付款，您的订阅将被停止。如果年度计划的自动续订失败，您将自动切换到月度计划。
        <br/>&emsp;5. 仅在付款后 7 个日历日内提出退款申请，才可获得年度付款的退款。要申请退款，您需要联系我们的支持团队。升级到更昂贵的计划、月度计划、增值包、交流社群均不予退款，即使在付款当天取消订阅也不例外。请注意，提交退款/争议请求或索赔的用户没有资格获得退款。
        <br/>&emsp;6. 我们的版主是 TodayStockKing 的官方代表，有权在用户（包括付费订阅的用户）不遵守内部规则时警告或禁止他们。如果您被禁止发布内容和与他人互动，我们不提供退款，因为您的付费订阅及其所有数据和/或功能在任何此类禁令期间仍然可用。
      </article>
      <h4>12. 终止</h4>
      <article>
        根据您的请求，您的帐户可以从 TodayStockKing 中删除。如果您请求删除您的帐户，我们将删除与您的帐户相关的个人数据，但是，如果某些个人数据已集成到我们系统和网站不可或缺的数据中，包括您通过我们的网站发送的通信中的数据，则将保留这些数据。这些数据必须保留，以保证网站上数据的完整性和我们的合法商业目的，包括审计、安全和其他合法利益（请参阅我们的隐私政策了解更多信息）。您发布的贡献将由我们自行决定保留在网站上。贡献一旦发布，就成为公共交易知识的一部分，并应保持这种状态。此政策防止用户只公开他们最好的想法，从而保持每个人的诚实并维护公众对网站声誉和完整性的信心。
        您同意 TodayStockKing 可以在不事先通知的情况下立即终止、限制您访问或暂停您的 TodayStockKing 帐户、任何相关电子邮件地址以及对 TodayStockKing 服务的访问。此类终止、访问限制或暂停的原因包括但不限于：(a) 违反或违背使用条款或其他纳入的协议或准则，(b) 执法机构或其他政府机构的要求，(c) TodayStockKing 服务（或其任何部分）的中止或重大修改，(d) 意外的技术或安全问题，(e) 长时间不活动，(f) 和/或您参与欺诈或非法活动。此外，您同意，所有终止、访问限制和因故暂停均由 TodayStockKing 自行决定，并且 TodayStockKing 不对您或任何第三方因终止您的帐户、任何相关电子邮件地址或对 TodayStockKing 服务的访问而承担责任。
      </article>
      <h4>13. 电子邮件</h4>
      <article>
        通过在 TodayStockKing 创建帐户，您同意 TodayStockKing 可以使用您的电子邮件地址向您发送营销材料、服务相关通知、重要信息消息、特别优惠等。您可以通过单击电子邮件中提供的链接取消订阅。
      </article>
      <h4>14. 内部规则</h4>
      <article>
        通过在 TodayStockKing 上创建和使用账户，您确认您已阅读并同意遵守我们的内部规则。
      </article>
      1<h4>5. 第三方软件</h4>
      <article>
        我们的软件、网站和/或服务可能包括由第三方提供的软件组件，这些组件经各自许可人和/或版权持有人许可使用，并遵守这些方提供的条款（“第三方软件”）。TodayStockKing 明确否认对您就第三方软件提供的任何担保或其他保证。请注意，您对第三方软件的使用将受第三方软件提供商的使用条款和条件以及隐私政策的约束，而不受本使用条款或我们的隐私政策的约束。
      </article>
      <h4>16. 责任限制</h4>
      <article>
        您明确理解并同意，TodayStockKing 及其关联公司、子公司、高管、董事、员工、代理商、合作伙伴和许可人不对您承担任何直接、间接、偶然、特殊、后果性或惩戒性损害赔偿责任，包括但不限于因利润损失、信誉损失、使用损失、数据损失、替代货物或服务的采购成本或其他无形损失（即使 TodayStockKing 已被告知此类损害的可能性）造成的损害赔偿责任，这些损害赔偿责任源于：
        使用或无法使用服务或使服务可用的软件或系统；
        对服务、价格的任何更改或对服务或其任何部分的任何临时或永久停止；
        使用、披露或显示您的用户生成内容；
      </article>
      <style jsx>
        {
          `
            article {
              font-size: 14px;
            }
          `
        }
      </style>
    </div>
  )
}